acaballero/etherlab/lib/ST77XX-STM32/Display_afb.cpp
    while (x < y) {
        if (f >= 0) {
            y--;
            ddF_y += 2;
            f += ddF_y;
        }
        x++;
        ddF_x += 2;
        f += ddF_x;

        setPixel(x0 + x, y0 + y, color);
        setPixel(x0 - x, y0 + y, color);
        setPixel(x0 + x, y0 - y, color);
        setPixel(x0 - x, y0 - y, color);

        setPixel(x0 + y, y0 + x, color);
        setPixel(x0 - y, y0 + x, color);
        setPixel(x0 + y, y0 - x, color);
        setPixel(x0 - y, y0 - x, color);
    }
    // Unselect();
}

void Display::invertColors(uint8_t invert) {
    // select();
    writeCommand(invert ? 0x21 /* INVON */ : 0x20 /* INVOFF */);
    // Unselect();
}

void Display::writeChar(char ch) {

    this->writeChar(px, py, ch, font, color, bgColor);
    this->px += font->width;
}

void Display::writeChar(int16_t x, int16_t y, char ch, const FontDef *font, uint16_t color, uint16_t bgcolor) {

    x += ox;
    y += oy;

    uint16_t i, b, j;
    int px, py = y, dy, y1, y2;
    uint16_t c;

    uint16_t width = this->curr_area->box.width;

    y1 = this->current_line;
    y2 = this->current_line + this->chunk_height;
    uint8_t start_char = font->start_char;

    if (py + font->height >= y1 && py < y2) {

        int si = max2(0, y1 - py);
        int ei = min2(font->height, y2 - py);
        int sdy = dy = max2(0, py - this->current_line);
        uint16_t mask;
        const uint8_t *data = ((FontDef8 *)font)->data;

        uint8_t incr = font->size - 1;

        if (font->encoding == ROWS) {

            mask = font->size == 2 ? 0x8000 : 0x80;
            data = data + (((ch - start_char) * font->height) << incr);

            for (i = si; i < ei; i++, dy++) {

                b = font->size == 2 ? ((uint16_t *)data)[i] : ((uint8_t *)data)[i << incr];

                // Commas and periods are too width in monospaced fonts. So we remove
                // columns from each side
                uint8_t j1, jn;
                if (trim_enabled && (ch == ',' || ch == '.' || ch == ':' || ch == ' ')) {
                    j1 = font->trim_punct_start;
                    jn = font->width - font->trim_punct_end;
                } else {
                    j1 = 0;
                    jn = font->width;
                }

                for (j = j1, px = x; j < jn; j++, px++) {

                    if ((b << j) & mask) {
                        c = color;
                    } else {
                        c = bgcolor;
                    }

                    if (c != C565_TRANSPARENT) {
                        uint16_t ix = ((dy * width) + px); // >> buffer->log2_pixels_per_byte;
                        *(this->curr_buffer + ix) = c;
                    }
                }
            }
        } else {

            data = data + (((ch - font->start_char) * font->width) << incr);

            // Commas and periods don't look good with monospaced fonts. So we remove
            // one blank column from each side
            uint8_t j1, jn;
            if (trim_enabled && (ch == ',' || ch == '.' || ch == ':' || ch == ' ')) {
                j1 = font->trim_punct_start;
                jn = font->width - font->trim_punct_end;
            } else {
                j1 = 0;
                jn = font->width;
            }

            for (j = j1, px = x; j < jn; j++, px++) {

                b = font->size == 2 ? ((uint16_t *)data)[j] : ((uint8_t *)data)[j << incr];

                for (i = si, dy = sdy; i < ei; i++, dy++) {

                    if ((b >> i) & 1) {
                        c = color;
                    } else {
                        c = bgcolor;
                    }

                    if (c != C565_TRANSPARENT) {
                        uint16_t ix = ((dy * width) + px); // >> buffer->log2_pixels_per_byte;
                        *(this->curr_buffer + ix) = c;
                    }
                }
            }
        }
    }
}

void Display::writeString(int16_t x, int16_t y, const char *str, const FontDef *font, uint16_t color, uint16_t bgcolor) {
    // select();

    uint8_t delta_punct = font->width - font->trim_punct_end - font->trim_punct_start;
    uint16_t max_width = this->hasOffset() ? ow : this->curr_area->box.width;
    uint16_t max_height = this->hasOffset() ? oh : this->curr_area->box.height;

    while (*str) {
        if (*str == '\n' || x + font->width >= max_width) {

            y += (font->height + (this->verticalSpacing * 2));
            x = padding_x;

            if (*str == '\n') {
                str++;
            }

            if (y + font->height >= max_height) {
                // No more vertical space
                break;
            }

            while (*str == ' ') {
                // skip spaces at the beginning of the new line
                str++;
            }

            if (!*str) {
                break;
            }
        }

        writeChar(x, y, *str, font, color, bgcolor);

        uint8_t delta_x;
        if (trim_enabled && (*str == ',' || *str == '.' || *str == ':' || *str == ' ')) {
            delta_x = delta_punct;
        } else {
            delta_x = font->width;
        }

        x += delta_x;
        str++;
    }
    px = x;
    py = y;
    // Unselect();
}

void Display::set_trim_enabled(bool b) {
    trim_enabled = b;
}

uint16_t *Display::getBuffer() {
    return this->curr_buffer;
}

void Display::gotoXY(int16_t x, int16_t y) {
    px = x;
    py = y;
}

uint16_t Display::getY() {
    return py;
}

void Display::gotoCharXY(int16_t x, int16_t y) {
    px = this->padding_x + (x * font->width);
    py = this->padding_y + this->verticalSpacing + (y * (font->height + (this->verticalSpacing * 2)));
}

uint8_t Display::getVerticalLineSpacing() {
    return this->verticalSpacing;
}

void Display::setVerticalLineSpacing(uint8_t pixels) {
    py = (int)py - ((int)this->verticalSpacing - (int)pixels);
    this->verticalSpacing = pixels;
}

void Display::setColor(uint16_t c) {
    this->color = c;
}

void Display::setBgColor(uint16_t c) {
    this->bgColor = c;
}

size_t Display::write(const uint8_t *buffer, size_t) {
    writeString(px, py, (const char *)buffer, font, color, bgColor);
    return 0;
}

size_t Display::write(uint8_t c) {
    writeChar(px, py, c, font, color, bgColor);
    return 0;
}

void Display::setFont(const FontDef *f) {
    this->font = f;
}

const FontDef *Display::getFont(void) {
    return this->font;
}

void Display::test(void) {
}

size_t Display::print(const char str[]) {
    return write(str);
}

size_t Display::print(const char str[], const char *value, const char units[]) {

    return this->print(str, value, units, C565_GREY_LIGHT, C565_WHITE, C565_GREY_LIGHT);
}

size_t Display::print(const char str[], const char *value, const char units[], uint16_t labelColor, uint16_t valueColor, uint16_t unitsColor) {

