acaballero/etherlab/lib/ST77XX-STM32/Display_afb.cpp
    uint16_t c = this->color;
    this->setColor(labelColor);
    write(str);
    this->setColor(valueColor);
    write(value);
    this->setColor(unitsColor);
    write(units);
    this->setColor(c);

    return 0;
}

void Display::setPadding(uint16_t x, uint16_t y) {
    padding_x = x;
    padding_y = y;
}

uint16_t Display::get_padding_x() {
    return padding_x;
}

uint16_t Display::get_padding_y() {
    return padding_y;
}

size_t Display::print(char c) {
    return write(c);
}

size_t Display::print(unsigned char b, int base) {
    return print((unsigned long)b, base);
}

size_t Display::print(int n, int base) {
    return print((long)n, base);
}

size_t Display::print(unsigned int n, int base) {
    return print((unsigned long)n, base);
}

size_t Display::print(long n, int base) {
    if (base == 0) {
        return write(n);
    } else if (base == 10) {
        if (n < 0) {
            int t = print('-');
            n = -n;
            return printNumber(n, 10) + t;
        }
        return printNumber(n, 10);
    } else {
        return printNumber(n, base);
    }
}

size_t Display::print(unsigned long n, int base) {
    if (base == 0) {
        return write(n);
    } else {
        return printNumber(n, base);
    }
}

size_t Display::print(double n, int digits) {
    return printFloat(n, digits);
}

size_t Display::printNumber(unsigned long n, uint8_t base) {
    char buf[8 * sizeof(long) + 1]; // Assumes 8-bit chars plus zero byte.
    char *str = &buf[sizeof(buf) - 1];

    *str = '\0';

    // prevent crash if called with base == 1
    if (base < 2) {
        base = 10;
    }

    do {
        unsigned long m = n;
        n /= base;
        char c = m - base * n;
        *--str = c < 10 ? c + '0' : c + 'A' - 10;
    } while (n);

    return write(str);
}

size_t Display::printFloat(double number, uint8_t digits) {
    size_t n = 0;

    if (isnan(number)) {
        return print("nan");
    }
    if (isinf(number)) {
        return print("inf");
    }
    if (number > 4294967040.0) {
        return print("ovf"); // constant determined empirically
    }
    if (number < -4294967040.0) {
        return print("ovf"); // constant determined empirically
    }

    // Handle negative numbers
    if (number < 0.0) {
        n += print('-');
        number = -number;
    }

    // Round correctly so that print(1.999, 2) prints as "2.00"
    double rounding = 0.5;
    for (uint8_t i = 0; i < digits; ++i) {
        rounding /= 10.0;
    }

    number += rounding;

    // Extract the integer part of the number and print it
    unsigned long int_part = (unsigned long)number;
    double remainder = number - (double)int_part;
    n += print(int_part);

    // Print the decimal point, but only if there are digits beyond
    if (digits > 0) {
        n += print(".");
    }

    // Extract digits from the remainder one at a time
    while (digits-- > 0) {
        remainder *= 10.0;
        int toPrint = int(remainder);
        n += print(toPrint);
        remainder -= toPrint;
    }

    return n;
}

bool Display::get_wrap_text() const {
    return wrap_text;
}

void Display::set_wrap_text(bool wrap_text) {
    Display::wrap_text = wrap_text;
}

Size Display::get_text_size(const std::string &text) {

    if (text.empty()) {
        return {0, 0};
    }

    int max_width = 0;
    int current_width = 0;
    int line_count = 1; // Start with 1 line

    for (char c : text) {
        if (c == '\n') {
            // End of line - update max width and start new line
            max_width = std::max(max_width, current_width);
            current_width = 0;
            line_count++;
        } else {
            // Regular character
            current_width += font->width;
        }
    }

    // Don't forget the last line if it doesn't end with newline
    max_width = std::max(max_width, current_width);

    return {max_width, line_count * (font->height + getVerticalLineSpacing() * 2)};
}
// Helper function to extract RGB components from RGB565 format
static inline void extract_rgb565(uint16_t pixel, uint8_t *r, uint8_t *g, uint8_t *b) {
    *r = (pixel >> 11) & 0x1F; // Extract 5-bit red
    *g = (pixel >> 5) & 0x3F;  // Extract 6-bit green
    *b = pixel & 0x1F;         // Extract 5-bit blue
}

// Helper function to combine RGB components into RGB565 format
static inline uint16_t combine_rgb565(uint8_t r, uint8_t g, uint8_t b) {
    return ((r & 0x1F) << 11) | ((g & 0x3F) << 5) | (b & 0x1F);
}

// Function to blend two RGB565 pixels with a given alpha value (0-255)
static inline uint16_t blend_pixel(uint16_t fg_pixel, uint16_t bg_pixel, uint8_t alpha) {
    uint8_t fg_r, fg_g, fg_b;
    uint8_t bg_r, bg_g, bg_b;

    // Extract RGB components from foreground and background pixels
    extract_rgb565(fg_pixel, &fg_r, &fg_g, &fg_b);
    extract_rgb565(bg_pixel, &bg_r, &bg_g, &bg_b);

    // Scale alpha to a fixed-point range [0, 256] to avoid division by 255
    uint16_t alpha_scaled = (alpha + 1); // Approximate (alpha / 255) as (alpha + 1) / 256

    // Blend using fixed-point arithmetic
    uint8_t blended_r = ((fg_r * alpha_scaled + bg_r * (256 - alpha_scaled)) >> 8);
    uint8_t blended_g = ((fg_g * alpha_scaled + bg_g * (256 - alpha_scaled)) >> 8);
    uint8_t blended_b = ((fg_b * alpha_scaled + bg_b * (256 - alpha_scaled)) >> 8);

    // Combine blended RGB components back into RGB565 format
    return combine_rgb565(blended_r, blended_g, blended_b);
}
